src/cf/Catalogs/инт_ПотокиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПотокиДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_НаправлениеПотокаДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах.(0 - сообщение будет обработано повторно как можно быстрее)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьОбработанныеСообщенияЧерез</Name>
					<Comment>Количество дней, через которое обработанные сообщения будут удалены(0 - сообщения не удаляются)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валидация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пример</Name>
					<Comment>Сериализованное представление примера исходных данных (ЗначениеВСтрокуВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АсинхроннаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Схемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСхемыПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкомпилированныйОбработчик</Name>
					<Comment>Скомпилированная внешняя обработка (EPF) из текста обработчика</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСкомпилированногоОбработчика</Name>
					<Comment>Признак версии: хеш текста, из которого получен СкомпилированныйОбработчик</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодписчикиПотока</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подписчик</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.инт_Подписчик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодпискиНаВходящиеСообщения</Name>
					<Comment>Источники входящих сообщений (Kafka/RabbitMQ консьюмеры)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подписка</Name>
							<Comment>Подписчик Kafka или RabbitMQ</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.инт_Подписка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/инт_НаправлениеПотокаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_НаправлениеПотокаДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/инт_ПотокиДанных/Forms/ФормаЭлемента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// инт_ПотокиДанных.ФормаЭлемента
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	конс_ПодключаемаяКонсольКлиент.ПодключитьРедактор(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	конс_ПодключаемаяКонсольСервер.ИнициализироватьРедактор(ЭтотОбъект, УникальныйИдентификатор, "РедакторКода");
    
    ЗаполнитьСписокВыбораИмяСхемПакета();
    ОбновитьВидимостьЭлементовФормы();
	
	// Во входящих потоках показывать только Kafka-подписчиков с флагом "Использовать как консьюмер"
	МассивОтборов = Новый Массив;
	МассивОтборов.Добавить(Новый ПараметрВыбора("Отбор.ИспользоватьКакКонсьюмер", Истина));
	Элементы.ПодпискиНаВходящиеСообщенияПодписка.ПараметрыВыбора = Новый ФиксированныйМассив(МассивОтборов);

	// Десериализуем Пример в реквизит формы ПримерСсылка
    Если ЗначениеЗаполнено(Объект.Пример) Тогда
        ПримерСсылка = ЗначениеИзСтрокиВнутр(Объект.Пример);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    // Десериализуем Пример в реквизит формы ПримерСсылка при чтении существующего объекта
    Если ЗначениеЗаполнено(Объект.Пример) Тогда
        ПримерСсылка = ЗначениеИзСтрокиВнутр(Объект.Пример);
    Иначе
        ПримерСсылка = Неопределено;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    // Сериализуем ПримерСсылка обратно в строку
    Если ЗначениеЗаполнено(ПримерСсылка) Тогда
        ТекущийОбъект.Пример = ЗначениеВСтрокуВнутр(ПримерСсылка);
    Иначе
        ТекущийОбъект.Пример = "";
    КонецЕсли;
    
    // Компилируем обработчик в EPF (пропускаем, если текст не изменился).
    Если ЗначениеЗаполнено(ТекущийОбъект.ТекстОбработчика) Тогда
        
        ТекущийХеш = инт_ГенераторОбработок.ХешТекстаОбработчика(ТекущийОбъект.ТекстОбработчика);
        ДвоичныеДанныеEPF = Неопределено;
        
        // 1. Проверяем кэш формы (EPF уже скомпилирован при проверке и актуален по хешу текста).
        Если ТекущийХеш = ХешПоследнейКомпиляции И ЗначениеЗаполнено(АдресEPFВоВременномХранилище) Тогда
            ДвоичныеДанныеEPF = ПолучитьИзВременногоХранилища(АдресEPFВоВременномХранилище);
        КонецЕсли;
        
        // 2. Проверяем сохранённый EPF в БД.
        Если ДвоичныеДанныеEPF = Неопределено И Не ТекущийОбъект.Ссылка.Пустая() Тогда
            Если ТекущийОбъект.ТекстОбработчика = ТекущийОбъект.Ссылка.ТекстОбработчика Тогда
                ДвоичныеДанныеEPF = ТекущийОбъект.Ссылка.СкомпилированныйОбработчик.Получить();
            КонецЕсли;
        КонецЕсли;
        
        // 3. Компилируем заново.
        Если ДвоичныеДанныеEPF = Неопределено Тогда
            Попытка
                ДвоичныеДанныеEPF = инт_ГенераторОбработок.СкомпилироватьОбработку(ТекущийОбъект.ТекстОбработчика);
            Исключение
                Сообщение = Новый СообщениеПользователю;
                Сообщение.Текст = "Ошибка компиляции обработчика: " + ОписаниеОшибки();
                Сообщение.Сообщить();
            КонецПопытки;
        КонецЕсли;
        
        Если ДвоичныеДанныеEPF <> Неопределено Тогда
            ТекущийОбъект.СкомпилированныйОбработчик = Новый ХранилищеЗначения(ДвоичныеДанныеEPF);
            ТекущийОбъект.ХешСкомпилированногоОбработчика = ТекущийХеш;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
   Объект.ТекстОбработчика = конс_ПодключаемаяКонсольКлиент.ПолучитьТекст(ЭтаФорма);
   
   ВалидироватьПередЗаписью = Истина;
   Если ПараметрыЗаписи.Свойство("ВалидироватьПередЗаписью") Тогда
	   ВалидироватьПередЗаписью = ПараметрыЗаписи.ВалидироватьПередЗаписью;
   КонецЕсли;

   Если ВалидироватьПередЗаписью Тогда
		
		ОчиститьСообщения();
		конс_ПодключаемаяКонсольКлиент.ОчиститьМаркерыОшибок(ЭтаФорма, "РедакторКода");
		
		// Сбрасываем кэш, чтобы EPF перекомпилировался из актуального текста.
		ХешПоследнейКомпиляции = "";
		
		Попытка
			ПодготовитьEPFДляПроверки();
		Исключение
			ПоказатьОшибкуВРедакторе(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Отказ = Истина;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаписи", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, "Ошибка компиляции обработчика!
			|Все равно записать?", РежимДиалогаВопрос.ДаНет, 60);
			Возврат;
		КонецПопытки;
		
		Если Не ПроверкаПрошлаУспешно() Тогда
			Отказ = Истина;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗаписи", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, "При проверке потока обнаружены ошибки!
			|Все равно записать?", РежимДиалогаВопрос.ДаНет, 60);
		КонецЕсли;
		
   КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СхемаДанныхПриИзменении(Элемент)
   	ЗаполнитьСписокВыбораИмяСхемПакета();
	РедакторКодаДокументСформирован(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПримерПриИзменении(Элемент)
	// Сериализуем ПримерСсылка в Объект.Пример для обновления отслеживаемых реквизитов
	Если ЗначениеЗаполнено(ПримерСсылка) Тогда
		Объект.Пример = ПримерСсылкаВСтроку(ПримерСсылка);
	Иначе
		Объект.Пример = "";
	КонецЕсли;
	ПерезаполнитьОтслеживаемыеРеквизиты();
	ВизуальныеНастройкиЭлементовФормСвязанныхСОтслеживаемымиРеквизитами();
    Объект.ТекстОбработчика = конс_ПодключаемаяКонсольКлиент.ПолучитьТекст(ЭтаФорма);
    РедакторКодаДокументСформирован(Элементы.РедакторКода);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПримерСсылкаВСтроку(Ссылка)
	Возврат ЗначениеВСтрокуВнутр(Ссылка);
КонецФункции

&НаКлиенте
Процедура РедакторКодаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	конс_ПодключаемаяКонсольКлиент.ОбработчикПриНажатии(ЭтаФорма, ДанныеСобытия);
		
КонецПроцедуры

&НаКлиенте
Процедура РедакторКодаДокументСформирован(Элемент)
	конс_ПодключаемаяКонсольКлиент.ОбработчикДокументСформирован(ЭтаФорма);
	ОбновитьКонтекстРедактора();
	конс_ПодключаемаяКонсольКлиент.ОчиститьТекст(ЭтаФорма);
	конс_ПодключаемаяКонсольКлиент.УстановитьТекст(ЭтаФорма, Объект.ТекстОбработчика);
КонецПроцедуры

&НаКлиенте
Процедура ТестовыеДанныеПриИзменении(Элемент)
	// Текст обработчика не перечитываем, чтобы не потерять несохраненные правки пользователя
	ОбновитьКонтекстРедактора();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПроверитьПоПримеру(Команда)
	ОчиститьСообщения();
	конс_ПодключаемаяКонсольКлиент.ОчиститьМаркерыОшибок(ЭтаФорма, "РедакторКода");
	Объект.ТекстОбработчика = конс_ПодключаемаяКонсольКлиент.ПолучитьТекст(ЭтаФорма);

	// Разбор проверяется до сборки: незакрытый блок и объявление Перем платформа
	// показала бы ошибкой в сгенерированном модуле, а не в тексте обработчика.
	ПроблемаРазбора = ПерваяПроблемаРазбора(Объект.ТекстОбработчика);
	Если ЗначениеЗаполнено(ПроблемаРазбора.Текст) Тогда
		ПоказатьОшибкуВРедакторе(ПроблемаРазбора.Текст, Ложь, ПроблемаРазбора.Строка);
		Возврат;
	КонецЕсли;

	// Подготавливаем EPF до замера производительности.
	Попытка
		ПодготовитьEPFДляПроверки();
	Исключение
		ПоказатьОшибкуВРедакторе(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если ПроверкаПрошлаУспешно() Тогда
		ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗамера;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Проверка прошла успешно!
		|Время выполнения: %1 мс.", ВремяВыполнения);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьОтслеживаемыеРеквизиты(Команда)
	ДопПараметры = Новый Структура("ОтслеживаемыеРеквизиты, СсылкаНаОбъект", Объект.ОтслеживаемыеРеквизиты, ПримерСсылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыРедактированияОтслеживаемыхРеквизитов", ЭтотОбъект);
	ОткрытьФорму("Справочник.инт_ПотокиДанных.Форма.РедактированиеОтслеживаемыхРеквизитов",ДопПараметры,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиенте
Функция СобратьОписаниеОжидаемогоРезультата() Экспорт;
    
   // TODO: !!!! Собирать описание ожидаемого результата, по OpenApi Схеме!!!!
   
   Результат = Новый структура;
   
   Результат.Вставить("ref", "classes.Соответствие");
   Результат.Вставить("description", "Соответствие содержащее сериализованную и подготовленную информацию, которая сможет пройти валидацию по схеме.");
   
   СтруктураПараметра = Новый Структура("ref, name, description", "catalogs.инт_ПотокиДанных", "Dataflow", "Поток данных");
   СтруктураПараметров = Новый Структура("Dataflow", СтруктураПараметра);
   Результат.Вставить("properties", СтруктураПараметров);
   
   Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПерезаполнитьОтслеживаемыеРеквизиты()
	
	Если ЗначениеЗаполнено(Объект.ОтслеживаемыеРеквизиты) Тогда
		ИсходныеДанные = ЗначениеИзСтрокиВнутр(Объект.ОтслеживаемыеРеквизиты);
	Иначе
		ИсходныеДанные = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПримерСсылка) Тогда
		Объект.ОтслеживаемыеРеквизиты = ЗначениеВСтрокуВнутр(Справочники.инт_ПотокиДанных.ЗаполнитьДеревоРеквизитовПоСсылке(ПримерСсылка, ИсходныеДанные));
	КонецЕсли;
	
КонецПроцедуры



// Подготовка EPF: компиляция или получение из кэша.
// Вызывается до замера производительности, чтобы компиляция не влияла на замер.
&НаСервере
Процедура ПодготовитьEPFДляПроверки()
	
	ТекущийХеш = инт_ГенераторОбработок.ХешТекстаОбработчика(Объект.ТекстОбработчика);

	// Карта строк готовится всегда: подсветка ошибки не должна зависеть от того,
	// получена ли обработка компиляцией, из кэша формы или из базы данных.
	СоответствиеСтрокМодуля = СтрокаСоответствияСтрок(Объект.ТекстОбработчика);

	// Если хеш совпадает — EPF уже в кэше формы, ничего не делаем.
	Если ТекущийХеш = ХешПоследнейКомпиляции И ЗначениеЗаполнено(АдресEPFВоВременномХранилище) Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанныеEPF = Неопределено;
	
	// Проверяем сохранённый EPF в БД.
	Если Не Объект.Ссылка.Пустая() Тогда
		Если Объект.ТекстОбработчика = Объект.Ссылка.ТекстОбработчика Тогда
			ДвоичныеДанныеEPF = Объект.Ссылка.СкомпилированныйОбработчик.Получить();
		КонецЕсли;
	КонецЕсли;
	
	// Компилируем заново.
	Если ДвоичныеДанныеEPF = Неопределено Тогда
		ДвоичныеДанныеEPF = инт_ГенераторОбработок.СкомпилироватьОбработку(Объект.ТекстОбработчика);
	КонецЕсли;
	
	// Сохраняем в кэш формы. Обработка прежней версии больше не годится для проверки.
	АдресEPFВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеEPF, УникальныйИдентификатор);
	ХешПоследнейКомпиляции = ТекущийХеш;
	ИмяПодключеннойОбработки = "";
	
КонецПроцедуры

// Исполнение обработчика. Замер производительности оборачивает только этот вызов.
&НаСервере
Процедура ПроверитьПоПримеруНаСервере()
	
	// Форма проверяет несохранённый текст, поэтому подключение держит она сама
	// и в кэш подключений сеанса не обращается.
	Если Не ЗначениеЗаполнено(ИмяПодключеннойОбработки) Тогда
		ИмяПодключеннойОбработки = инт_ГенераторОбработок.ПодключитьОбработку(
			ПолучитьИзВременногоХранилища(АдресEPFВоВременномХранилище),
			инт_ГенераторОбработок.ИмяРегистрацииОбработки(Объект.Ссылка, ХешПоследнейКомпиляции));
	КонецЕсли;
	
	Если Объект.НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий Тогда
		Результат = инт_ГенераторОбработок.ИсполнитьОбработку(ИмяПодключеннойОбработки, ПримерСсылка);
		
		Если Объект.Валидация Тогда
			Справочники.инт_ПотокиДанных.ВалидироватьСообщениеПоПотоку(Результат, Объект);
		КонецЕсли;
	Иначе
		Соответствие = ДесериализоватьИВалидироватьТестовыеДанные();
		Если Соответствие = Неопределено Тогда
			Возврат;
		КонецЕсли;
		инт_ГенераторОбработок.ИсполнитьОбработку(ИмяПодключеннойОбработки, Соответствие, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДесериализоватьИВалидироватьТестовыеДанные()
	Попытка
		Соответствие = инт_КоннекторHTTP.JsonВОбъект(ТестовыеДанные);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось разобрать Json.";
		Сообщение.Поле = "ТестовыеДанные";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецПопытки;
	
	Справочники.инт_ПотокиДанных.ВалидироватьСообщениеПоПотоку(Соответствие, Объект);
	Возврат Соответствие;
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораИмяСхемПакета()
    Элементы.ИмяСхемыПакета.СписокВыбора.ЗагрузитьЗначения(Справочники.инт_Схемы.МассивИменПакетовПоСхеме(Объект.СхемаДанных));
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементовФормы()
    
	ЭтоВходящийПоток = Объект.НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Входящий;
	ЭтоИсходящийПоток = Объект.НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий;
	
	Элементы.АсинхроннаяОбработка.Видимость = ЭтоВходящийПоток;
    Элементы.ГруппаПодписчики.Видимость = ЭтоИсходящийПоток;
    Элементы.ГруппаПример.Видимость = ЭтоИсходящийПоток;
	Элементы.ТестовыеДанные.Видимость = ЭтоВходящийПоток;
	Элементы.ГруппаПодпискиВходящие.Видимость = ЭтоВходящийПоток;
	
	ВизуальныеНастройкиЭлементовФормСвязанныхСОтслеживаемымиРеквизитами();
КонецПроцедуры

&НаСервере
Процедура ВизуальныеНастройкиЭлементовФормСвязанныхСОтслеживаемымиРеквизитами()
	Элементы.ОпределитьОтслеживаемыеРеквизиты.Видимость = ЗначениеЗаполнено(Объект.ОтслеживаемыеРеквизиты);
	Если Не ЗначениеЗаполнено(Объект.ОтслеживаемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = ЗначениеИзСтрокиВнутр(Объект.ОтслеживаемыеРеквизиты);
	
	Если НЕ Дерево.Строки.Найти(2, "ОтслеживатьИзменения", Истина) = Неопределено Тогда
		Элементы.ОпределитьОтслеживаемыеРеквизиты.Заголовок = "Список отслеживаемых реквизитов";
		Элементы.ОпределитьОтслеживаемыеРеквизиты.Картинка = БиблиотекаКартинок.ВыбратьЗначение;
		Элементы.ПредупреждениеОбОтслеживаемыхРеквизитах.Видимость = Истина;
		Элементы.ПредупреждениеОбОтслеживаемыхРеквизитах.Заголовок = "Внимание! Отслеживается изменение только части реквизитов!";
		Элементы.ПредупреждениеОбОтслеживаемыхРеквизитах.ЦветТекста = ЦветаСтиля.ЦветАкцента;
	ИначеЕсли Дерево.Строки.Найти(1, "ОтслеживатьИзменения", Истина) = Неопределено Тогда
		Элементы.ОпределитьОтслеживаемыеРеквизиты.Заголовок = "Список отслеживаемых реквизитов";
		Элементы.ОпределитьОтслеживаемыеРеквизиты.Картинка = БиблиотекаКартинок.ВыбратьЗначение;
		Элементы.ПредупреждениеОбОтслеживаемыхРеквизитах.Видимость = Истина;
		Элементы.ПредупреждениеОбОтслеживаемыхРеквизитах.Заголовок = "Ошибка! В списке отслеживаемых реквизитов нет ни одного значения!";
		Элементы.ПредупреждениеОбОтслеживаемыхРеквизитах.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
	Иначе
		Элементы.ОпределитьОтслеживаемыеРеквизиты.Заголовок = "Отслеживаются любые изменения";
		Элементы.ОпределитьОтслеживаемыеРеквизиты.Картинка = БиблиотекаКартинок.СинтаксическийКонтроль;
		Элементы.ПредупреждениеОбОтслеживаемыхРеквизитах.Видимость = Ложь;
	КонецЕсли;
	Элементы.ОпределитьОтслеживаемыеРеквизиты.Доступность = ЗначениеЗаполнено(ПримерСсылка);
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеПотокаПриИзменении(Элемент)
    ОбновитьВидимостьЭлементовФормы();
	РедакторКодаДокументСформирован(Неопределено);
КонецПроцедуры

&НаКлиенте
Функция ПроверкаПрошлаУспешно()
	Успех = Истина; 

	Попытка
		ПроверитьПоПримеруНаСервере();
	Исключение
		ПоказатьОшибкуВРедакторе(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), Истина);
		Успех = Ложь;
	КонецПопытки;
	
	Возврат Успех;
КонецФункции

//Вынести в отдельную процедуру
&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаписи(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать(Новый Структура("ВалидироватьПередЗаписью", Ложь));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияОтслеживаемыхРеквизитов(ОтслеживаемыеРеквизиты, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(ОтслеживаемыеРеквизиты) Тогда
		Объект.ОтслеживаемыеРеквизиты = ОтслеживаемыеРеквизиты;
	КонецЕсли;
	
	ВизуальныеНастройкиЭлементовФормСвязанныхСОтслеживаемымиРеквизитами();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКонтекстРедактора()
	ДобавитьПеременные();
	УстановитьСхему();
	конс_ПодключаемаяКонсольКлиент.ЗагрузитьПользовательскийКонтекст(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ДобавитьПеременные()

	// Очищаем предыдущие переменные — при смене направления набор переменных меняется
	ОчиститьПеременныеКонтекста();
	
	// Имена и назначения берутся из общего контракта: подсказки редактора, объявления
	// сформированного модуля и документация должны совпадать (см. ТР-Ф-060).
	Для Каждого ОписаниеПеременной Из инт_ГенераторОбработок.ПеременныеКонтекста(ВидОбработчикаПотока()) Цикл
		конс_ПодключаемаяКонсольСервер.ДобавитьПеременную(ЭтотОбъект,
			ОписаниеПеременной.Имя,
			ЗначениеПодсказкиПеременной(ОписаниеПеременной.Имя),
			ОписаниеПеременной.Назначение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПеременныеКонтекста()
	Попытка
		ПараметрыРедактора = ЭтотОбъект.конс_СтруктураПараметровРедактораКода;
		ПараметрыРедактора.JSONПеременных = "";
		Если ЗначениеЗаполнено(ПараметрыРедактора.АдресЗначенийПеременных) Тогда
			ПоместитьВоВременноеХранилище(Новый Соответствие, ПараметрыРедактора.АдресЗначенийПеременных);
		КонецЕсли;
		// Необходимо переприсвоить реквизит формы, чтобы платформа зафиксировала изменения
		ЭтотОбъект.конс_СтруктураПараметровРедактораКода = ПараметрыРедактора;
	Исключение
		// Структура параметров ещё не инициализирована
	КонецПопытки;
КонецПроцедуры 


&НаКлиенте
Процедура УстановитьСхему()
	Если Не ЗначениеЗаполнено(Объект.СхемаДанных) или Не ЗначениеЗаполнено(Объект.ИмяСхемыПакета) Тогда 
		Возврат;
	КонецЕсли;     
	Схема = ПолучитьТекстСхемы(); 
	конс_ПодключаемаяКонсольКлиент.ЗагрузитьФайлСхемы(ЭтаФорма, Схема);
	
	Если Объект.НаправлениеПотока = ПредопределенноеЗначение("Перечисление.инт_НаправлениеПотокаДанных.Исходящий") Тогда
		конс_ПодключаемаяКонсольКлиент.ЗагрузитьСхемуПеременной(ЭтаФорма, "Результат", Схема, Объект.ИмяСхемыПакета);
	Иначе
		конс_ПодключаемаяКонсольКлиент.ЗагрузитьСхемуПеременной(ЭтаФорма, "ИсходныеДанные", Схема, Объект.ИмяСхемыПакета);
	КонецЕсли;

КонецПроцедуры   


&НаКлиенте
Процедура ИмяСхемыПакетаПриИзменении(Элемент)
	РедакторКодаДокументСформирован(Неопределено);
КонецПроцедуры


&НаСервере
Функция ПолучитьТекстСхемы()

	Возврат Справочники.инт_Схемы.ПолучитьOpenApiСхему(Объект.СхемаДанных);

КонецФункции 

// Показать ошибку в редакторе кода с подсветкой строки.
// Извлекает номер строки и колонки из текста ошибки,
// очищает текст от внутренних путей модулей {Модуль.Путь(N,M)}:
// и вызывает подсветку соответствующей строки в Monaco-редакторе.
//
// Параметры:
//  ТекстОшибки        - Строка - Текст ошибки (из КраткоеПредставлениеОшибки или лога).
//  ЭтоОшибкаВыполнения - Булево - Истина если ошибка runtime (нужен перевод строки по карте),
//                                  Ложь если ошибка компиляции (строки уже пересчитаны).
//  СтрокаОбработчика  - Число - Номер строки текста обработчика, если он известен заранее:
//                                  так приходят проблемы разбора, в тексте которых координат нет.
&НаКлиенте
Процедура ПоказатьОшибкуВРедакторе(Знач ТекстОшибки, Знач ЭтоОшибкаВыполнения = Ложь,
	Знач СтрокаОбработчика = 0)
	
	НомерСтроки = СтрокаОбработчика;
	НомерКолонки = 1;

	// Очищаем текст от блоков {Модуль.Путь(N,M)}: — они не информативны для пользователя.
	// Координаты извлекаем из самого внутреннего (последнего) блока.
	Пока Истина Цикл
		ПозФигОткр = СтрНайти(ТекстОшибки, "{");
		Если ПозФигОткр = 0 Тогда
			Прервать;
		КонецЕсли;
		ПозФигЗакр = СтрНайти(ТекстОшибки, "}", , ПозФигОткр);
		Если ПозФигЗакр = 0 Тогда
			Прервать;
		КонецЕсли;
		Суффикс = Сред(ТекстОшибки, ПозФигЗакр + 1);
		Если Не СтрНачинаетсяС(Суффикс, ": ") Тогда
			Прервать;
		КонецЕсли;
		
		// Извлекаем координаты (N,M) из содержимого блока.
		СодержимоеБлока = Сред(ТекстОшибки, ПозФигОткр + 1, ПозФигЗакр - ПозФигОткр - 1);
		ПозОткрСк = СтрНайти(СодержимоеБлока, "(");
		Если ПозОткрСк > 0 Тогда
			ПозЗакрСк = СтрНайти(СодержимоеБлока, ")", , ПозОткрСк);
			Если ПозЗакрСк > 0 Тогда
				Координаты = Сред(СодержимоеБлока, ПозОткрСк + 1, ПозЗакрСк - ПозОткрСк - 1);
				Части = СтрРазделить(Координаты, ",");
				Если Части.Количество() >= 2 Тогда
					Попытка
						ВозможнаяСтрока = Число(СокрЛП(Части[0]));
						ВозможнаяКолонка = Число(СокрЛП(Части[1]));
						Если ВозможнаяСтрока > 0 Тогда
							НомерСтроки = ВозможнаяСтрока;
							НомерКолонки = ВозможнаяКолонка;
						КонецЕсли;
					Исключение
						// Не числовые координаты.
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Убираем блок {…}: из текста.
		ТекстОшибки = СокрЛ(Лев(ТекстОшибки, ПозФигОткр - 1) + Сред(ТекстОшибки, ПозФигЗакр + 3));
	КонецЦикла;
	ТекстОшибки = СокрЛП(ТекстОшибки);
	
	// Для ошибок выполнения переводим номер строки модуля EPF в строку исходного текста.
	Если ЭтоОшибкаВыполнения И НомерСтроки > 0 Тогда
		ИсходнаяСтрока = ИсходнаяСтрокаОбработчика(НомерСтроки);
		Если ИсходнаяСтрока = 0 Тогда
			// Строке модуля не соответствует ни одна строка исходного текста:
			// ошибка в служебной части сформированного модуля.
			ТекстОшибки = ТекстОшибки + Символы.ПС
				+ "Ошибка возникла вне текста обработчика, в служебной части сформированного модуля.";
			НомерСтроки = 0;
			НомерКолонки = 1;
		Иначе
			НомерСтроки = ИсходнаяСтрока;
		КонецЕсли;
	КонецЕсли;
	
	конс_ПодключаемаяКонсольКлиент.ПоказатьОшибку(ЭтаФорма, ТекстОшибки, НомерСтроки, НомерКолонки, "РедакторКода");
	
КонецПроцедуры

// Вид обработчика для контракта переменных контекста, см. инт_ГенераторОбработок.ПеременныеКонтекста.
//
// Возвращаемое значение:
//  Строка - Вид обработчика по направлению потока.
//
&НаСервере
Функция ВидОбработчикаПотока()

	Если Объект.НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий Тогда
		Возврат "ПотокДанныхИсходящий";
	КонецЕсли;

	Возврат "ПотокДанныхВходящий";

КонецФункции

// Образец значения переменной контекста для подсказок редактора кода.
// Имя и назначение задаёт контракт, а образец значения зависит от состояния формы.
//
// Параметры:
//  ИмяПеременной - Строка - Имя переменной контекста.
//
// Возвращаемое значение:
//  Произвольный - Образец значения либо его тип.
//
&НаСервере
Функция ЗначениеПодсказкиПеременной(Знач ИмяПеременной)

	Если ИмяПеременной = "Результат" Тогда
		Возврат Новый Соответствие;
	КонецЕсли;

	Если Объект.НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий Тогда
		Возврат ПримерСсылка;
	КонецЕсли;

	Возврат Справочники.инт_ПотокиДанных.ИсходныеДанныеДляОтладчика(ТестовыеДанные);

КонецФункции

// Первая проблема, обнаруженная разбором текста обработчика.
//
// Параметры:
//  ТекстОбработчика - Строка - Проверяемый текст обработчика.
//
// Возвращаемое значение:
//  Структура:
//   * Строка - Число - Номер строки текста обработчика. Ноль, если проблем нет.
//   * Текст  - Строка - Описание проблемы. Пустая строка, если проблем нет.
//
&НаСервереБезКонтекста
Функция ПерваяПроблемаРазбора(Знач ТекстОбработчика)

	Проблема = Новый Структура("Строка, Текст", 0, "");

	Блоки = инт_ГенераторОбработок.РазобратьКодНаБлоки(ТекстОбработчика);
	Если Блоки.Проблемы.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(Проблема, Блоки.Проблемы[0]);
	КонецЕсли;

	Возврат Проблема;

КонецФункции

// Номер строки исходного текста обработчика по номеру строки сформированного модуля.
// Ноль означает, что строке модуля не соответствует ни одна строка исходного текста.
//
// Параметры:
//  НомерСтрокиМодуля - Число - Номер строки сформированного модуля.
//
// Возвращаемое значение:
//  Число - Номер строки исходного текста обработчика или ноль.
//
&НаКлиенте
Функция ИсходнаяСтрокаОбработчика(Знач НомерСтрокиМодуля)

	Если Не ЗначениеЗаполнено(СоответствиеСтрокМодуля) Тогда
		Возврат 0;
	КонецЕсли;

	НомераСтрок = СтрРазделить(СоответствиеСтрокМодуля, ",");
	Если НомерСтрокиМодуля < 1 Или НомерСтрокиМодуля > НомераСтрок.Количество() Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Число(НомераСтрок[НомерСтрокиМодуля - 1]);

КонецФункции

// Карта строк модуля в виде строки: номера строк исходного текста через запятую,
// позиция в списке соответствует номеру строки сформированного модуля.
// Соответствие реквизитом формы быть не может, а строка может.
//
// Параметры:
//  ТекстОбработчика - Строка - Исходный текст обработчика.
//
// Возвращаемое значение:
//  Строка - Номера строк исходного текста через запятую.
//
&НаСервереБезКонтекста
Функция СтрокаСоответствияСтрок(Знач ТекстОбработчика)

	Соответствие = инт_ГенераторОбработок.СоответствиеСтрокМодуля(ТекстОбработчика);

	ПоследняяСтрока = 0;
	Для Каждого КлючИЗначение Из Соответствие Цикл
		ПоследняяСтрока = Макс(ПоследняяСтрока, КлючИЗначение.Ключ);
	КонецЦикла;

	НомераСтрок = Новый Массив;
	Для НомерСтроки = 1 По ПоследняяСтрока Цикл
		ИсходнаяСтрока = Соответствие[НомерСтроки];
		НомераСтрок.Добавить(Формат(?(ИсходнаяСтрока = Неопределено, 0, ИсходнаяСтрока), "ЧГ=0"));
	КонецЦикла;

	Возврат СтрСоединить(НомераСтрок, ",");

КонецФункции

#КонецОбласти
